{"format": "graph-model", "generatedBy": "2.6.0", "convertedBy": "TensorFlow.js Converter v3.12.0", "signature": {"inputs": {"sequential_input": {"name": "sequential_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "150"}, {"size": "150"}, {"size": "3"}]}}}, "outputs": {"dense_2": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "4"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/stack_1/0", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/sub/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv_1_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_DOUBLE", "tensorShape": {}}}, "dtype": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/Greater/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_DOUBLE", "tensorShape": {}}}, "dtype": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/sub_1/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv_2_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_DOUBLE", "tensorShape": {}}}, "dtype": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/stack_1/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d/Conv2D/ArithmeticOptimizer/FoldMultiplyIntoConv_scaled_StatefulPartitionedCall/sequential_1/conv2d/Conv2D_ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_3/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_4/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/flatten/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2304"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_2/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "sequential_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "150"}, {"size": "150"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/Shape", "op": "Shape", "input": ["sequential_input"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/Shape", "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice/stack", "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice/stack_1", "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/Shape", "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice_1/stack", "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice_1/stack_1", "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice_1/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice"], "attr": {"SrcT": {"type": "DT_INT32"}, "Truncate": {"b": false}, "DstT": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv/Cast_1", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice_1"], "attr": {"SrcT": {"type": "DT_INT32"}, "Truncate": {"b": false}, "DstT": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv", "op": "RealDiv", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv/Cast", "StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv/Cast_1"], "attr": {"T": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/Greater", "op": "Greater", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv", "StatefulPartitionedCall/sequential_1/sequential/random_crop/Greater/y"], "attr": {"T": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/cond/StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice/_24", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice", "StatefulPartitionedCall/sequential_1/sequential/random_crop/Greater"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/cond/switch_pred/_21", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/Greater", "StatefulPartitionedCall/sequential_1/sequential/random_crop/Greater"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/cond_1/StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice/_34", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice", "StatefulPartitionedCall/sequential_1/sequential/random_crop/Greater"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/cond_1/switch_pred/_30", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/Greater", "StatefulPartitionedCall/sequential_1/sequential/random_crop/Greater"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/cond/StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice_1/_25", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice_1", "StatefulPartitionedCall/sequential_1/sequential/random_crop/Greater"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/cond_1/StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice_1/_33", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice_1", "StatefulPartitionedCall/sequential_1/sequential/random_crop/Greater"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/cond/pivot_f/_22", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/cond/switch_pred/_21"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/cond/pivot_t/_23", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/cond/switch_pred/_21:1"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/cond_1/pivot_f/_31", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/cond_1/switch_pred/_30"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/cond_1/pivot_t/_32", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/cond_1/switch_pred/_30:1"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "Func/StatefulPartitionedCall/sequential_1/sequential/random_crop/cond/else/_20/output/_45", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_1/sequential/random_crop/cond/pivot_f/_22"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/cond/then/_19/sequential_1/sequential/random_crop/cond/mul/x", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_1/sequential/random_crop/cond/pivot_t/_23"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/cond/then/_19/sequential_1/sequential/random_crop/cond/truediv/Cast_1", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/cond/StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice_1/_25:1", "^StatefulPartitionedCall/sequential_1/sequential/random_crop/cond/pivot_t/_23"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_INT32"}, "DstT": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/cond_1/else/_29/sequential_1/sequential/random_crop/cond_1/mul/x", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_1/sequential/random_crop/cond_1/pivot_f/_31"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/cond_1/else/_29/sequential_1/sequential/random_crop/cond_1/truediv/Cast_1", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/cond_1/StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice/_34", "^StatefulPartitionedCall/sequential_1/sequential/random_crop/cond_1/pivot_f/_31"], "attr": {"SrcT": {"type": "DT_INT32"}, "DstT": {"type": "DT_DOUBLE"}, "Truncate": {"b": false}}}, {"name": "Func/StatefulPartitionedCall/sequential_1/sequential/random_crop/cond_1/then/_28/output/_50", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_1/sequential/random_crop/cond_1/pivot_t/_32"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/cond/then/_19/sequential_1/sequential/random_crop/cond/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/cond/then/_19/sequential_1/sequential/random_crop/cond/mul/x", "StatefulPartitionedCall/sequential_1/sequential/random_crop/cond/StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice/_24:1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/cond_1/else/_29/sequential_1/sequential/random_crop/cond_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/cond_1/else/_29/sequential_1/sequential/random_crop/cond_1/mul/x", "StatefulPartitionedCall/sequential_1/sequential/random_crop/cond_1/StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice_1/_33"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/cond/then/_19/sequential_1/sequential/random_crop/cond/truediv/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/cond/then/_19/sequential_1/sequential/random_crop/cond/mul"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_DOUBLE"}, "SrcT": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/cond_1/else/_29/sequential_1/sequential/random_crop/cond_1/truediv/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/cond_1/else/_29/sequential_1/sequential/random_crop/cond_1/mul"], "attr": {"DstT": {"type": "DT_DOUBLE"}, "SrcT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/cond/then/_19/sequential_1/sequential/random_crop/cond/truediv", "op": "RealDiv", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/cond/then/_19/sequential_1/sequential/random_crop/cond/truediv/Cast", "StatefulPartitionedCall/sequential_1/sequential/random_crop/cond/then/_19/sequential_1/sequential/random_crop/cond/truediv/Cast_1"], "attr": {"T": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/cond_1/else/_29/sequential_1/sequential/random_crop/cond_1/truediv", "op": "RealDiv", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/cond_1/else/_29/sequential_1/sequential/random_crop/cond_1/truediv/Cast", "StatefulPartitionedCall/sequential_1/sequential/random_crop/cond_1/else/_29/sequential_1/sequential/random_crop/cond_1/truediv/Cast_1"], "attr": {"T": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/cond/then/_19/sequential_1/sequential/random_crop/cond/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/cond/then/_19/sequential_1/sequential/random_crop/cond/truediv"], "attr": {"SrcT": {"type": "DT_DOUBLE"}, "Truncate": {"b": false}, "DstT": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/cond_1/else/_29/sequential_1/sequential/random_crop/cond_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/cond_1/else/_29/sequential_1/sequential/random_crop/cond_1/truediv"], "attr": {"DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/cond/output/_26", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/cond/then/_19/sequential_1/sequential/random_crop/cond/Cast", "Func/StatefulPartitionedCall/sequential_1/sequential/random_crop/cond/else/_20/output/_45"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/cond_1/output/_35", "op": "Merge", "input": ["Func/StatefulPartitionedCall/sequential_1/sequential/random_crop/cond_1/then/_28/output/_50", "StatefulPartitionedCall/sequential_1/sequential/random_crop/cond_1/else/_29/sequential_1/sequential/random_crop/cond_1/Cast"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/sub", "op": "Sub", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/cond/output/_26", "StatefulPartitionedCall/sequential_1/sequential/random_crop/sub/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/stack", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/cond/output/_26", "StatefulPartitionedCall/sequential_1/sequential/random_crop/cond_1/output/_35"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/sub_1", "op": "Sub", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/cond_1/output/_35", "StatefulPartitionedCall/sequential_1/sequential/random_crop/sub_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/sub"], "attr": {"SrcT": {"type": "DT_INT32"}, "Truncate": {"b": false}, "DstT": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/resize/ResizeBilinear", "op": "ResizeBilinear", "input": ["sequential_input", "StatefulPartitionedCall/sequential_1/sequential/random_crop/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}, "half_pixel_centers": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv_2/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/sub_1"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_DOUBLE"}, "SrcT": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv_1/Cast", "ConstantFolding/StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv_1_recip"], "attr": {"T": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv_2", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv_2/Cast", "ConstantFolding/StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv_2_recip"], "attr": {"T": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv_1"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_INT32"}, "SrcT": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/Cast_1", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv_2"], "attr": {"DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/stack_1", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/stack_1/0", "StatefulPartitionedCall/sequential_1/sequential/random_crop/Cast", "StatefulPartitionedCall/sequential_1/sequential/random_crop/Cast_1", "StatefulPartitionedCall/sequential_1/sequential/random_crop/stack_1/3"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "4"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/Slice", "op": "Slice", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/resize/ResizeBilinear", "StatefulPartitionedCall/sequential_1/sequential/random_crop/stack_1", "StatefulPartitionedCall/sequential_1/sequential/random_crop/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/Slice", "StatefulPartitionedCall/sequential_1/conv2d/Conv2D/ArithmeticOptimizer/FoldMultiplyIntoConv_scaled_StatefulPartitionedCall/sequential_1/conv2d/Conv2D_ReadVariableOp", "StatefulPartitionedCall/sequential_1/conv2d/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/sequential_1/max_pooling2d/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1/conv2d/Relu"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/max_pooling2d/MaxPool", "StatefulPartitionedCall/sequential_1/conv2d_1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_1/conv2d_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/max_pooling2d_1/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1/conv2d_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/max_pooling2d_1/MaxPool", "StatefulPartitionedCall/sequential_1/conv2d_2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_1/conv2d_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/max_pooling2d_2/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1/conv2d_2/Relu"], "attr": {"padding": {"s": "VkFMSUQ="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/max_pooling2d_2/MaxPool", "StatefulPartitionedCall/sequential_1/conv2d_3/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_1/conv2d_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_1/max_pooling2d_3/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1/conv2d_3/Relu"], "attr": {"explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_4/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/max_pooling2d_3/MaxPool", "StatefulPartitionedCall/sequential_1/conv2d_4/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_1/conv2d_4/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/sequential_1/max_pooling2d_4/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1/conv2d_4/Relu"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/flatten/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_1/max_pooling2d_4/MaxPool", "StatefulPartitionedCall/sequential_1/flatten/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/flatten/Reshape", "StatefulPartitionedCall/sequential_1/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense/Relu", "StatefulPartitionedCall/sequential_1/dense_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_2/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_1/Relu", "StatefulPartitionedCall/sequential_1/dense_2/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1/dense_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 808}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/stack_1/0", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/sub/y", "shape": [], "dtype": "int32"}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv_1_recip", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice_1/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice_1/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice_1/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/Greater/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/sub_1/y", "shape": [], "dtype": "int32"}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv_2_recip", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/stack_1/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/stack_2", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d/Conv2D/ArithmeticOptimizer/FoldMultiplyIntoConv_scaled_StatefulPartitionedCall/sequential_1/conv2d/Conv2D_ReadVariableOp", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1/Conv2D/ReadVariableOp", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_2/Conv2D/ReadVariableOp", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_2/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_3/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_3/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_4/Conv2D/ReadVariableOp", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_4/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/dense/MatMul/ReadVariableOp", "shape": [2304, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/MatMul/ReadVariableOp", "shape": [512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_2/MatMul/ReadVariableOp", "shape": [512, 4], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_2/BiasAdd/ReadVariableOp", "shape": [4], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/sequential_1/sequential/random_crop/cond/else/_20/output/_45", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/cond/then/_19/sequential_1/sequential/random_crop/cond/mul/x", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/cond_1/else/_29/sequential_1/sequential/random_crop/cond_1/mul/x", "shape": [], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/sequential_1/sequential/random_crop/cond_1/then/_28/output/_50", "shape": [], "dtype": "int32"}]}]}