{"format": "graph-model", "generatedBy": "2.6.0", "convertedBy": "TensorFlow.js Converter v3.12.0", "signature": {"inputs": {"sequential_input": {"name": "sequential_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "150"}, {"size": "150"}, {"size": "3"}]}}}, "outputs": {"dense_2": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "4"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/stack_1/0", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/sub/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv_1_recip", "op": "Const", "attr": {"dtype": {"type": "DT_DOUBLE"}, "value": {"tensor": {"dtype": "DT_DOUBLE", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/Greater/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_DOUBLE", "tensorShape": {}}}, "dtype": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/sub_1/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv_2_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_DOUBLE", "tensorShape": {}}}, "dtype": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/stack_1/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d/Conv2D/ArithmeticOptimizer/FoldMultiplyIntoConv_scaled_StatefulPartitionedCall/sequential_1/conv2d/Conv2D_ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_3/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_4/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/flatten/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2304"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_2/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "sequential_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "150"}, {"size": "150"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/Shape", "op": "Shape", "input": ["sequential_input"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/Shape", "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice_1/stack", "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice_1/stack_1", "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice_1/stack_2"], "attr": {"begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/Shape", "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice/stack", "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice/stack_1", "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv/Cast_1", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice_1"], "attr": {"SrcT": {"type": "DT_INT32"}, "DstT": {"type": "DT_DOUBLE"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice"], "attr": {"SrcT": {"type": "DT_INT32"}, "DstT": {"type": "DT_DOUBLE"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv", "op": "RealDiv", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv/Cast", "StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv/Cast_1"], "attr": {"T": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/Greater", "op": "Greater", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv", "StatefulPartitionedCall/sequential_1/sequential/random_crop/Greater/y"], "attr": {"T": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/cond", "op": "StatelessIf", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/Greater", "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice", "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice_1"], "attr": {"Tin": {"list": {"type": ["DT_INT32", "DT_INT32"]}}, "Tout": {"list": {"type": ["DT_INT32"]}}, "_lower_using_switch_merge": {"b": false}, "else_branch": {"func": {"name": "__inference_sequential_1_sequential_random_crop_cond_false_1044_7080"}}, "output_shapes": {"list": {"shape": [{}]}}, "_read_only_resource_inputs": {"list": {}}, "then_branch": {"func": {"name": "__inference_sequential_1_sequential_random_crop_cond_true_1043_7838"}}, "Tcond": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/cond_1", "op": "StatelessIf", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/Greater", "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice_1", "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice"], "attr": {"then_branch": {"func": {"name": "__inference_sequential_1_sequential_random_crop_cond_1_true_1062_6874"}}, "Tout": {"list": {"type": ["DT_INT32"]}}, "Tin": {"list": {"type": ["DT_INT32", "DT_INT32"]}}, "_read_only_resource_inputs": {"list": {}}, "else_branch": {"func": {"name": "__inference_sequential_1_sequential_random_crop_cond_1_false_1063_5793"}}, "_lower_using_switch_merge": {"b": false}, "output_shapes": {"list": {"shape": [{}]}}, "Tcond": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/sub", "op": "Sub", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/cond", "StatefulPartitionedCall/sequential_1/sequential/random_crop/sub/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/stack", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/cond", "StatefulPartitionedCall/sequential_1/sequential/random_crop/cond_1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/sub_1", "op": "Sub", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/cond_1", "StatefulPartitionedCall/sequential_1/sequential/random_crop/sub_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/sub"], "attr": {"DstT": {"type": "DT_DOUBLE"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/resize/ResizeBilinear", "op": "ResizeBilinear", "input": ["sequential_input", "StatefulPartitionedCall/sequential_1/sequential/random_crop/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "half_pixel_centers": {"b": true}, "align_corners": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv_2/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/sub_1"], "attr": {"DstT": {"type": "DT_DOUBLE"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv_1/Cast", "ConstantFolding/StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv_1_recip"], "attr": {"T": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv_2", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv_2/Cast", "ConstantFolding/StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv_2_recip"], "attr": {"T": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv_1"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_INT32"}, "SrcT": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/Cast_1", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv_2"], "attr": {"DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/stack_1", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/stack_1/0", "StatefulPartitionedCall/sequential_1/sequential/random_crop/Cast", "StatefulPartitionedCall/sequential_1/sequential/random_crop/Cast_1", "StatefulPartitionedCall/sequential_1/sequential/random_crop/stack_1/3"], "attr": {"axis": {"i": "0"}, "N": {"i": "4"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/Slice", "op": "Slice", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/resize/ResizeBilinear", "StatefulPartitionedCall/sequential_1/sequential/random_crop/stack_1", "StatefulPartitionedCall/sequential_1/sequential/random_crop/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/sequential/random_crop/Slice", "StatefulPartitionedCall/sequential_1/conv2d/Conv2D/ArithmeticOptimizer/FoldMultiplyIntoConv_scaled_StatefulPartitionedCall/sequential_1/conv2d/Conv2D_ReadVariableOp", "StatefulPartitionedCall/sequential_1/conv2d/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_1/max_pooling2d/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1/conv2d/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/max_pooling2d/MaxPool", "StatefulPartitionedCall/sequential_1/conv2d_1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_1/conv2d_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/sequential_1/max_pooling2d_1/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1/conv2d_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/max_pooling2d_1/MaxPool", "StatefulPartitionedCall/sequential_1/conv2d_2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_1/conv2d_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential_1/max_pooling2d_2/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1/conv2d_2/Relu"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/max_pooling2d_2/MaxPool", "StatefulPartitionedCall/sequential_1/conv2d_3/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_1/conv2d_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/sequential_1/max_pooling2d_3/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1/conv2d_3/Relu"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_4/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/max_pooling2d_3/MaxPool", "StatefulPartitionedCall/sequential_1/conv2d_4/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_1/conv2d_4/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/sequential_1/max_pooling2d_4/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1/conv2d_4/Relu"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/flatten/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_1/max_pooling2d_4/MaxPool", "StatefulPartitionedCall/sequential_1/flatten/Const"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/flatten/Reshape", "StatefulPartitionedCall/sequential_1/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense/Relu", "StatefulPartitionedCall/sequential_1/dense_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_2/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_1/Relu", "StatefulPartitionedCall/sequential_1/dense_2/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1/dense_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {"function": [{"signature": {"name": "__inference_sequential_1_sequential_random_crop_cond_1_false_1063_5793", "inputArg": [{"name": "sequential_1_sequential_random_crop_cond_1_mul_sequential_1_sequential_random_crop_strided_slice_1", "type": "DT_INT32"}, {"name": "sequential_1_sequential_random_crop_cond_1_truediv_cast_1_sequential_1_sequential_random_crop_strided_slice", "type": "DT_INT32"}], "outputArg": [{"name": "sequential_1_sequential_random_crop_cond_1_identity", "type": "DT_INT32"}]}, "nodeDef": [{"name": "__inference_sequential_1_sequential_random_crop_cond_1_false_1063_5793/sequential_1/sequential/random_crop/cond_1/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "sequential_1/sequential/random_crop/cond_1/truediv/Cast_1", "op": "Cast", "input": ["sequential_1_sequential_random_crop_cond_1_truediv_cast_1_sequential_1_sequential_random_crop_strided_slice"], "attr": {"DstT": {"type": "DT_DOUBLE"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_INT32"}}}, {"name": "sequential_1/sequential/random_crop/cond_1/mul", "op": "Mul", "input": ["__inference_sequential_1_sequential_random_crop_cond_1_false_1063_5793/sequential_1/sequential/random_crop/cond_1/mul/x:output:0", "sequential_1_sequential_random_crop_cond_1_mul_sequential_1_sequential_random_crop_strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "sequential_1/sequential/random_crop/cond_1/truediv/Cast", "op": "Cast", "input": ["sequential_1/sequential/random_crop/cond_1/mul:z:0"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_DOUBLE"}, "SrcT": {"type": "DT_INT32"}}}, {"name": "sequential_1/sequential/random_crop/cond_1/truediv", "op": "RealDiv", "input": ["sequential_1/sequential/random_crop/cond_1/truediv/Cast:y:0", "sequential_1/sequential/random_crop/cond_1/truediv/Cast_1:y:0"], "attr": {"T": {"type": "DT_DOUBLE"}}}, {"name": "sequential_1/sequential/random_crop/cond_1/Cast", "op": "Cast", "input": ["sequential_1/sequential/random_crop/cond_1/truediv:z:0"], "attr": {"SrcT": {"type": "DT_DOUBLE"}, "Truncate": {"b": false}, "DstT": {"type": "DT_INT32"}}}], "ret": {"sequential_1_sequential_random_crop_cond_1_identity": "sequential_1/sequential/random_crop/cond_1/Cast:y:0"}, "attr": {"_construction_context": {"s": "a0VhZ2VyUnVudGltZQ=="}}, "argAttr": {"1": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}}}, {"signature": {"name": "__inference_sequential_1_sequential_random_crop_cond_true_1043_7838", "inputArg": [{"name": "sequential_1_sequential_random_crop_cond_mul_sequential_1_sequential_random_crop_strided_slice", "type": "DT_INT32"}, {"name": "sequential_1_sequential_random_crop_cond_truediv_cast_1_sequential_1_sequential_random_crop_strided_slice_1", "type": "DT_INT32"}], "outputArg": [{"name": "sequential_1_sequential_random_crop_cond_identity", "type": "DT_INT32"}]}, "nodeDef": [{"name": "__inference_sequential_1_sequential_random_crop_cond_true_1043_7838/sequential_1/sequential/random_crop/cond/mul/x", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "sequential_1/sequential/random_crop/cond/truediv/Cast_1", "op": "Cast", "input": ["sequential_1_sequential_random_crop_cond_truediv_cast_1_sequential_1_sequential_random_crop_strided_slice_1"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_DOUBLE"}, "SrcT": {"type": "DT_INT32"}}}, {"name": "sequential_1/sequential/random_crop/cond/mul", "op": "Mul", "input": ["__inference_sequential_1_sequential_random_crop_cond_true_1043_7838/sequential_1/sequential/random_crop/cond/mul/x:output:0", "sequential_1_sequential_random_crop_cond_mul_sequential_1_sequential_random_crop_strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "sequential_1/sequential/random_crop/cond/truediv/Cast", "op": "Cast", "input": ["sequential_1/sequential/random_crop/cond/mul:z:0"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_DOUBLE"}, "SrcT": {"type": "DT_INT32"}}}, {"name": "sequential_1/sequential/random_crop/cond/truediv", "op": "RealDiv", "input": ["sequential_1/sequential/random_crop/cond/truediv/Cast:y:0", "sequential_1/sequential/random_crop/cond/truediv/Cast_1:y:0"], "attr": {"T": {"type": "DT_DOUBLE"}}}, {"name": "sequential_1/sequential/random_crop/cond/Cast", "op": "Cast", "input": ["sequential_1/sequential/random_crop/cond/truediv:z:0"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_DOUBLE"}, "DstT": {"type": "DT_INT32"}}}], "ret": {"sequential_1_sequential_random_crop_cond_identity": "sequential_1/sequential/random_crop/cond/Cast:y:0"}, "attr": {"_construction_context": {"s": "a0VhZ2VyUnVudGltZQ=="}}, "argAttr": {"0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "1": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}}}, {"signature": {"name": "__inference_sequential_1_sequential_random_crop_cond_1_true_1062_6874", "inputArg": [{"name": "sequential_1_sequential_random_crop_cond_1_placeholder", "type": "DT_INT32"}, {"name": "sequential_1_sequential_random_crop_cond_1_placeholder_1", "type": "DT_INT32"}], "outputArg": [{"name": "sequential_1_sequential_random_crop_cond_1_identity", "type": "DT_INT32"}]}, "nodeDef": [{"name": "__inference_sequential_1_sequential_random_crop_cond_1_true_1062_6874/sequential_1/sequential/random_crop/cond_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}], "ret": {"sequential_1_sequential_random_crop_cond_1_identity": "sequential_1/sequential/random_crop/cond_1/Const:output:0"}, "attr": {"_construction_context": {"s": "a0VhZ2VyUnVudGltZQ=="}}, "argAttr": {"1": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}}}, {"signature": {"name": "__inference_sequential_1_sequential_random_crop_cond_false_1044_7080", "inputArg": [{"name": "sequential_1_sequential_random_crop_cond_placeholder", "type": "DT_INT32"}, {"name": "sequential_1_sequential_random_crop_cond_placeholder_1", "type": "DT_INT32"}], "outputArg": [{"name": "sequential_1_sequential_random_crop_cond_identity", "type": "DT_INT32"}]}, "nodeDef": [{"name": "__inference_sequential_1_sequential_random_crop_cond_false_1044_7080/sequential_1/sequential/random_crop/cond/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}], "ret": {"sequential_1_sequential_random_crop_cond_identity": "sequential_1/sequential/random_crop/cond/Const:output:0"}, "attr": {"_construction_context": {"s": "a0VhZ2VyUnVudGltZQ=="}}, "argAttr": {"1": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}}}]}, "versions": {"producer": 808, "minConsumer": 12}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/stack_1/0", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/sub/y", "shape": [], "dtype": "int32"}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv_1_recip", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/Greater/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice_1/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice_1/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice_1/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/sub_1/y", "shape": [], "dtype": "int32"}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_1/sequential/random_crop/truediv_2_recip", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/stack_1/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/sequential/random_crop/stack_2", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d/Conv2D/ArithmeticOptimizer/FoldMultiplyIntoConv_scaled_StatefulPartitionedCall/sequential_1/conv2d/Conv2D_ReadVariableOp", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1/Conv2D/ReadVariableOp", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_2/Conv2D/ReadVariableOp", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_2/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_3/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_3/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_4/Conv2D/ReadVariableOp", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_4/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/dense/MatMul/ReadVariableOp", "shape": [2304, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/MatMul/ReadVariableOp", "shape": [512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_2/MatMul/ReadVariableOp", "shape": [512, 4], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_2/BiasAdd/ReadVariableOp", "shape": [4], "dtype": "float32"}, {"name": "__inference_sequential_1_sequential_random_crop_cond_1_false_1063_5793/sequential_1/sequential/random_crop/cond_1/mul/x", "shape": [], "dtype": "int32"}, {"name": "__inference_sequential_1_sequential_random_crop_cond_true_1043_7838/sequential_1/sequential/random_crop/cond/mul/x", "shape": [], "dtype": "int32"}, {"name": "__inference_sequential_1_sequential_random_crop_cond_1_true_1062_6874/sequential_1/sequential/random_crop/cond_1/Const", "shape": [], "dtype": "int32"}, {"name": "__inference_sequential_1_sequential_random_crop_cond_false_1044_7080/sequential_1/sequential/random_crop/cond/Const", "shape": [], "dtype": "int32"}]}]}