{"format": "graph-model", "generatedBy": "2.6.0", "convertedBy": "TensorFlow.js Converter v2.6.0", "userDefinedMetadata": {"signature": {"inputs": {"sequential_input:0": {"name": "sequential_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "150"}, {"size": "150"}, {"size": "3"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "4"}]}}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/stack_1/0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/sub/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv_1_recip", "op": "Const", "attr": {"dtype": {"type": "DT_DOUBLE"}, "value": {"tensor": {"dtype": "DT_DOUBLE", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/Greater/y", "op": "Const", "attr": {"dtype": {"type": "DT_DOUBLE"}, "value": {"tensor": {"dtype": "DT_DOUBLE", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/sub_1/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv_2_recip", "op": "Const", "attr": {"dtype": {"type": "DT_DOUBLE"}, "value": {"tensor": {"dtype": "DT_DOUBLE", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/stack_1/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/flatten_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_3/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "43200"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_4/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_5/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_5/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_6/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_6/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "sequential_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "150"}, {"size": "150"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/Shape", "op": "Shape", "input": ["sequential_input"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/Shape", "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice_1/stack", "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice_1/stack_1", "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice_1/stack_2"], "attr": {"end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/Shape", "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice/stack", "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice/stack_1", "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv/Cast_1", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice_1"], "attr": {"DstT": {"type": "DT_DOUBLE"}, "SrcT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_DOUBLE"}, "SrcT": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv", "op": "RealDiv", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv/Cast", "StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv/Cast_1"], "attr": {"T": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/Greater", "op": "Greater", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv", "StatefulPartitionedCall/sequential_2/sequential/random_crop/Greater/y"], "attr": {"T": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/cond", "op": "StatelessIf", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/Greater", "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice", "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice_1"], "attr": {"_lower_using_switch_merge": {"b": false}, "output_shapes": {"list": {"shape": [{}]}}, "_read_only_resource_inputs": {"list": {}}, "Tin": {"list": {"type": ["DT_INT32", "DT_INT32"]}}, "else_branch": {"func": {"name": "__inference_sequential_2_sequential_random_crop_cond_false_28557_146"}}, "Tcond": {"type": "DT_BOOL"}, "then_branch": {"func": {"name": "__inference_sequential_2_sequential_random_crop_cond_true_28556_1592"}}, "Tout": {"list": {"type": ["DT_INT32"]}}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/cond_1", "op": "StatelessIf", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/Greater", "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice_1", "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice"], "attr": {"then_branch": {"func": {"name": "__inference_sequential_2_sequential_random_crop_cond_1_true_28575_555"}}, "Tout": {"list": {"type": ["DT_INT32"]}}, "_read_only_resource_inputs": {"list": {}}, "_lower_using_switch_merge": {"b": false}, "Tin": {"list": {"type": ["DT_INT32", "DT_INT32"]}}, "output_shapes": {"list": {"shape": [{}]}}, "Tcond": {"type": "DT_BOOL"}, "else_branch": {"func": {"name": "__inference_sequential_2_sequential_random_crop_cond_1_false_28576_656"}}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/sub", "op": "Sub", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/cond", "StatefulPartitionedCall/sequential_2/sequential/random_crop/sub/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/stack", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/cond", "StatefulPartitionedCall/sequential_2/sequential/random_crop/cond_1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/sub_1", "op": "Sub", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/cond_1", "StatefulPartitionedCall/sequential_2/sequential/random_crop/sub_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/sub"], "attr": {"DstT": {"type": "DT_DOUBLE"}, "SrcT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/resize/ResizeBilinear", "op": "ResizeBilinear", "input": ["sequential_input", "StatefulPartitionedCall/sequential_2/sequential/random_crop/stack"], "attr": {"align_corners": {"b": false}, "half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv_2/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/sub_1"], "attr": {"DstT": {"type": "DT_DOUBLE"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv_1/Cast", "ConstantFolding/StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv_1_recip"], "attr": {"T": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv_2", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv_2/Cast", "ConstantFolding/StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv_2_recip"], "attr": {"T": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv_1"], "attr": {"SrcT": {"type": "DT_DOUBLE"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/Cast_1", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv_2"], "attr": {"DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/stack_1", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/stack_1/0", "StatefulPartitionedCall/sequential_2/sequential/random_crop/Cast", "StatefulPartitionedCall/sequential_2/sequential/random_crop/Cast_1", "StatefulPartitionedCall/sequential_2/sequential/random_crop/stack_1/3"], "attr": {"axis": {"i": "0"}, "N": {"i": "4"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/Slice", "op": "Slice", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/resize/ResizeBilinear", "StatefulPartitionedCall/sequential_2/sequential/random_crop/stack_1", "StatefulPartitionedCall/sequential_2/sequential/random_crop/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/flatten_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/Slice", "StatefulPartitionedCall/sequential_2/flatten_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_3/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2/flatten_1/Reshape", "StatefulPartitionedCall/sequential_2/dense_3/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_2/dense_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_4/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2/dense_3/Relu", "StatefulPartitionedCall/sequential_2/dense_4/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_2/dense_4/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_5/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2/dense_4/Relu", "StatefulPartitionedCall/sequential_2/dense_5/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_2/dense_5/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_6/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2/dense_5/Relu", "StatefulPartitionedCall/sequential_2/dense_6/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_2/dense_6/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_2/dense_6/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {"function": [{"signature": {"name": "__inference_sequential_2_sequential_random_crop_cond_false_28557_146", "inputArg": [{"name": "sequential_2_sequential_random_crop_cond_placeholder", "type": "DT_INT32"}, {"name": "sequential_2_sequential_random_crop_cond_placeholder_1", "type": "DT_INT32"}], "outputArg": [{"name": "sequential_2_sequential_random_crop_cond_identity", "type": "DT_INT32"}]}, "nodeDef": [{"name": "__inference_sequential_2_sequential_random_crop_cond_false_28557_146/sequential_2/sequential/random_crop/cond/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}, "experimentalDebugInfo": {"originalNodeNames": ["sequential_2/sequential/random_crop/cond/Const"]}}], "ret": {"sequential_2_sequential_random_crop_cond_identity": "sequential_2/sequential/random_crop/cond/Const:output:0"}, "attr": {"_construction_context": {"s": "a0VhZ2VyUnVudGltZQ=="}}, "argAttr": {"0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "1": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}}}, {"signature": {"name": "__inference_sequential_2_sequential_random_crop_cond_1_true_28575_555", "inputArg": [{"name": "sequential_2_sequential_random_crop_cond_1_placeholder", "type": "DT_INT32"}, {"name": "sequential_2_sequential_random_crop_cond_1_placeholder_1", "type": "DT_INT32"}], "outputArg": [{"name": "sequential_2_sequential_random_crop_cond_1_identity", "type": "DT_INT32"}]}, "nodeDef": [{"name": "__inference_sequential_2_sequential_random_crop_cond_1_true_28575_555/sequential_2/sequential/random_crop/cond_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "experimentalDebugInfo": {"originalNodeNames": ["sequential_2/sequential/random_crop/cond_1/Const"]}}], "ret": {"sequential_2_sequential_random_crop_cond_1_identity": "sequential_2/sequential/random_crop/cond_1/Const:output:0"}, "attr": {"_construction_context": {"s": "a0VhZ2VyUnVudGltZQ=="}}, "argAttr": {"1": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}}}, {"signature": {"name": "__inference_sequential_2_sequential_random_crop_cond_true_28556_1592", "inputArg": [{"name": "sequential_2_sequential_random_crop_cond_mul_sequential_2_sequential_random_crop_strided_slice", "type": "DT_INT32"}, {"name": "sequential_2_sequential_random_crop_cond_truediv_cast_1_sequential_2_sequential_random_crop_strided_slice_1", "type": "DT_INT32"}], "outputArg": [{"name": "sequential_2_sequential_random_crop_cond_identity", "type": "DT_INT32"}]}, "nodeDef": [{"name": "__inference_sequential_2_sequential_random_crop_cond_true_28556_1592/sequential_2/sequential/random_crop/cond/mul/x", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "experimentalDebugInfo": {"originalNodeNames": ["sequential_2/sequential/random_crop/cond/mul/x"]}}, {"name": "sequential_2/sequential/random_crop/cond/truediv/Cast_1", "op": "Cast", "input": ["sequential_2_sequential_random_crop_cond_truediv_cast_1_sequential_2_sequential_random_crop_strided_slice_1"], "attr": {"SrcT": {"type": "DT_INT32"}, "DstT": {"type": "DT_DOUBLE"}, "Truncate": {"b": false}}, "experimentalDebugInfo": {"originalNodeNames": ["sequential_2/sequential/random_crop/cond/truediv/Cast_1"]}}, {"name": "sequential_2/sequential/random_crop/cond/mul", "op": "Mul", "input": ["__inference_sequential_2_sequential_random_crop_cond_true_28556_1592/sequential_2/sequential/random_crop/cond/mul/x:output:0", "sequential_2_sequential_random_crop_cond_mul_sequential_2_sequential_random_crop_strided_slice"], "attr": {"T": {"type": "DT_INT32"}}, "experimentalDebugInfo": {"originalNodeNames": ["sequential_2/sequential/random_crop/cond/mul"]}}, {"name": "sequential_2/sequential/random_crop/cond/truediv/Cast", "op": "Cast", "input": ["sequential_2/sequential/random_crop/cond/mul:z:0"], "attr": {"DstT": {"type": "DT_DOUBLE"}, "SrcT": {"type": "DT_INT32"}, "Truncate": {"b": false}}, "experimentalDebugInfo": {"originalNodeNames": ["sequential_2/sequential/random_crop/cond/truediv/Cast"]}}, {"name": "sequential_2/sequential/random_crop/cond/truediv", "op": "RealDiv", "input": ["sequential_2/sequential/random_crop/cond/truediv/Cast:y:0", "sequential_2/sequential/random_crop/cond/truediv/Cast_1:y:0"], "attr": {"T": {"type": "DT_DOUBLE"}}, "experimentalDebugInfo": {"originalNodeNames": ["sequential_2/sequential/random_crop/cond/truediv"]}}, {"name": "sequential_2/sequential/random_crop/cond/Cast", "op": "Cast", "input": ["sequential_2/sequential/random_crop/cond/truediv:z:0"], "attr": {"DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_DOUBLE"}}, "experimentalDebugInfo": {"originalNodeNames": ["sequential_2/sequential/random_crop/cond/Cast"]}}], "ret": {"sequential_2_sequential_random_crop_cond_identity": "sequential_2/sequential/random_crop/cond/Cast:y:0"}, "attr": {"_construction_context": {"s": "a0VhZ2VyUnVudGltZQ=="}}, "argAttr": {"1": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}}}, {"signature": {"name": "__inference_sequential_2_sequential_random_crop_cond_1_false_28576_656", "inputArg": [{"name": "sequential_2_sequential_random_crop_cond_1_mul_sequential_2_sequential_random_crop_strided_slice_1", "type": "DT_INT32"}, {"name": "sequential_2_sequential_random_crop_cond_1_truediv_cast_1_sequential_2_sequential_random_crop_strided_slice", "type": "DT_INT32"}], "outputArg": [{"name": "sequential_2_sequential_random_crop_cond_1_identity", "type": "DT_INT32"}]}, "nodeDef": [{"name": "__inference_sequential_2_sequential_random_crop_cond_1_false_28576_656/sequential_2/sequential/random_crop/cond_1/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}, "experimentalDebugInfo": {"originalNodeNames": ["sequential_2/sequential/random_crop/cond_1/mul/x"]}}, {"name": "sequential_2/sequential/random_crop/cond_1/truediv/Cast_1", "op": "Cast", "input": ["sequential_2_sequential_random_crop_cond_1_truediv_cast_1_sequential_2_sequential_random_crop_strided_slice"], "attr": {"SrcT": {"type": "DT_INT32"}, "Truncate": {"b": false}, "DstT": {"type": "DT_DOUBLE"}}, "experimentalDebugInfo": {"originalNodeNames": ["sequential_2/sequential/random_crop/cond_1/truediv/Cast_1"]}}, {"name": "sequential_2/sequential/random_crop/cond_1/mul", "op": "Mul", "input": ["__inference_sequential_2_sequential_random_crop_cond_1_false_28576_656/sequential_2/sequential/random_crop/cond_1/mul/x:output:0", "sequential_2_sequential_random_crop_cond_1_mul_sequential_2_sequential_random_crop_strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}, "experimentalDebugInfo": {"originalNodeNames": ["sequential_2/sequential/random_crop/cond_1/mul"]}}, {"name": "sequential_2/sequential/random_crop/cond_1/truediv/Cast", "op": "Cast", "input": ["sequential_2/sequential/random_crop/cond_1/mul:z:0"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_DOUBLE"}, "SrcT": {"type": "DT_INT32"}}, "experimentalDebugInfo": {"originalNodeNames": ["sequential_2/sequential/random_crop/cond_1/truediv/Cast"]}}, {"name": "sequential_2/sequential/random_crop/cond_1/truediv", "op": "RealDiv", "input": ["sequential_2/sequential/random_crop/cond_1/truediv/Cast:y:0", "sequential_2/sequential/random_crop/cond_1/truediv/Cast_1:y:0"], "attr": {"T": {"type": "DT_DOUBLE"}}, "experimentalDebugInfo": {"originalNodeNames": ["sequential_2/sequential/random_crop/cond_1/truediv"]}}, {"name": "sequential_2/sequential/random_crop/cond_1/Cast", "op": "Cast", "input": ["sequential_2/sequential/random_crop/cond_1/truediv:z:0"], "attr": {"SrcT": {"type": "DT_DOUBLE"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}, "experimentalDebugInfo": {"originalNodeNames": ["sequential_2/sequential/random_crop/cond_1/Cast"]}}], "ret": {"sequential_2_sequential_random_crop_cond_1_identity": "sequential_2/sequential/random_crop/cond_1/Cast:y:0"}, "attr": {"_construction_context": {"s": "a0VhZ2VyUnVudGltZQ=="}}, "argAttr": {"1": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}}}]}, "versions": {"producer": 898, "minConsumer": 12}}, "weightsManifest": [{"paths": ["group1-shard1of6.bin", "group1-shard2of6.bin", "group1-shard3of6.bin", "group1-shard4of6.bin", "group1-shard5of6.bin", "group1-shard6of6.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/stack_1/0", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/sub/y", "shape": [], "dtype": "int32"}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv_1_recip", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/Greater/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice_1/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice_1/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice_1/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/sub_1/y", "shape": [], "dtype": "int32"}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv_2_recip", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/stack_1/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/stack_2", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/flatten_1/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_3/MatMul/ReadVariableOp", "shape": [43200, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_3/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_4/MatMul/ReadVariableOp", "shape": [128, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_4/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_5/MatMul/ReadVariableOp", "shape": [256, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_5/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_6/MatMul/ReadVariableOp", "shape": [512, 4], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_6/BiasAdd/ReadVariableOp", "shape": [4], "dtype": "float32"}, {"name": "__inference_sequential_2_sequential_random_crop_cond_false_28557_146/sequential_2/sequential/random_crop/cond/Const", "shape": [], "dtype": "int32"}, {"name": "__inference_sequential_2_sequential_random_crop_cond_1_true_28575_555/sequential_2/sequential/random_crop/cond_1/Const", "shape": [], "dtype": "int32"}, {"name": "__inference_sequential_2_sequential_random_crop_cond_true_28556_1592/sequential_2/sequential/random_crop/cond/mul/x", "shape": [], "dtype": "int32"}, {"name": "__inference_sequential_2_sequential_random_crop_cond_1_false_28576_656/sequential_2/sequential/random_crop/cond_1/mul/x", "shape": [], "dtype": "int32"}]}]}