{"format": "graph-model", "generatedBy": "2.6.0", "convertedBy": "TensorFlow.js Converter v3.12.0", "signature": {"inputs": {"sequential_input": {"name": "sequential_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "150"}, {"size": "150"}, {"size": "3"}]}}}, "outputs": {"dense_6": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "4"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/stack_1/0", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/sub/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv_1_recip", "op": "Const", "attr": {"dtype": {"type": "DT_DOUBLE"}, "value": {"tensor": {"dtype": "DT_DOUBLE", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/Greater/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_DOUBLE", "tensorShape": {}}}, "dtype": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/sub_1/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv_2_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_DOUBLE", "tensorShape": {}}}, "dtype": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/stack_1/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/flatten_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_3/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "43200"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_4/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_5/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_5/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_6/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_6/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "sequential_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "150"}, {"size": "150"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/Shape", "op": "Shape", "input": ["sequential_input"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/Shape", "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice/stack", "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice/stack_1", "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/Shape", "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice_1/stack", "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice_1/stack_1", "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice_1/stack_2"], "attr": {"begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice"], "attr": {"DstT": {"type": "DT_DOUBLE"}, "SrcT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv/Cast_1", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice_1"], "attr": {"SrcT": {"type": "DT_INT32"}, "Truncate": {"b": false}, "DstT": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv", "op": "RealDiv", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv/Cast", "StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv/Cast_1"], "attr": {"T": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/Greater", "op": "Greater", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv", "StatefulPartitionedCall/sequential_2/sequential/random_crop/Greater/y"], "attr": {"T": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/cond/StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice/_16", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice", "StatefulPartitionedCall/sequential_2/sequential/random_crop/Greater"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/cond/switch_pred/_13", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/Greater", "StatefulPartitionedCall/sequential_2/sequential/random_crop/Greater"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/cond_1/StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice/_26", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice", "StatefulPartitionedCall/sequential_2/sequential/random_crop/Greater"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/cond_1/switch_pred/_22", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/Greater", "StatefulPartitionedCall/sequential_2/sequential/random_crop/Greater"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/cond/StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice_1/_17", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice_1", "StatefulPartitionedCall/sequential_2/sequential/random_crop/Greater"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/cond_1/StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice_1/_25", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice_1", "StatefulPartitionedCall/sequential_2/sequential/random_crop/Greater"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/cond/pivot_f/_14", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/cond/switch_pred/_13"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/cond/pivot_t/_15", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/cond/switch_pred/_13:1"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/cond_1/pivot_f/_23", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/cond_1/switch_pred/_22"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/cond_1/pivot_t/_24", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/cond_1/switch_pred/_22:1"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "Func/StatefulPartitionedCall/sequential_2/sequential/random_crop/cond/else/_12/output/_37", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_2/sequential/random_crop/cond/pivot_f/_14"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/cond/then/_11/sequential_2/sequential/random_crop/cond/mul/x", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_2/sequential/random_crop/cond/pivot_t/_15"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/cond/then/_11/sequential_2/sequential/random_crop/cond/truediv/Cast_1", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/cond/StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice_1/_17:1", "^StatefulPartitionedCall/sequential_2/sequential/random_crop/cond/pivot_t/_15"], "attr": {"DstT": {"type": "DT_DOUBLE"}, "SrcT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/cond_1/else/_21/sequential_2/sequential/random_crop/cond_1/mul/x", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_2/sequential/random_crop/cond_1/pivot_f/_23"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/cond_1/else/_21/sequential_2/sequential/random_crop/cond_1/truediv/Cast_1", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/cond_1/StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice/_26", "^StatefulPartitionedCall/sequential_2/sequential/random_crop/cond_1/pivot_f/_23"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_DOUBLE"}, "SrcT": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/sequential_2/sequential/random_crop/cond_1/then/_20/output/_42", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_2/sequential/random_crop/cond_1/pivot_t/_24"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/cond/then/_11/sequential_2/sequential/random_crop/cond/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/cond/then/_11/sequential_2/sequential/random_crop/cond/mul/x", "StatefulPartitionedCall/sequential_2/sequential/random_crop/cond/StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice/_16:1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/cond_1/else/_21/sequential_2/sequential/random_crop/cond_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/cond_1/else/_21/sequential_2/sequential/random_crop/cond_1/mul/x", "StatefulPartitionedCall/sequential_2/sequential/random_crop/cond_1/StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice_1/_25"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/cond/then/_11/sequential_2/sequential/random_crop/cond/truediv/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/cond/then/_11/sequential_2/sequential/random_crop/cond/mul"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_DOUBLE"}, "SrcT": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/cond_1/else/_21/sequential_2/sequential/random_crop/cond_1/truediv/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/cond_1/else/_21/sequential_2/sequential/random_crop/cond_1/mul"], "attr": {"DstT": {"type": "DT_DOUBLE"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/cond/then/_11/sequential_2/sequential/random_crop/cond/truediv", "op": "RealDiv", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/cond/then/_11/sequential_2/sequential/random_crop/cond/truediv/Cast", "StatefulPartitionedCall/sequential_2/sequential/random_crop/cond/then/_11/sequential_2/sequential/random_crop/cond/truediv/Cast_1"], "attr": {"T": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/cond_1/else/_21/sequential_2/sequential/random_crop/cond_1/truediv", "op": "RealDiv", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/cond_1/else/_21/sequential_2/sequential/random_crop/cond_1/truediv/Cast", "StatefulPartitionedCall/sequential_2/sequential/random_crop/cond_1/else/_21/sequential_2/sequential/random_crop/cond_1/truediv/Cast_1"], "attr": {"T": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/cond/then/_11/sequential_2/sequential/random_crop/cond/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/cond/then/_11/sequential_2/sequential/random_crop/cond/truediv"], "attr": {"DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/cond_1/else/_21/sequential_2/sequential/random_crop/cond_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/cond_1/else/_21/sequential_2/sequential/random_crop/cond_1/truediv"], "attr": {"DstT": {"type": "DT_INT32"}, "SrcT": {"type": "DT_DOUBLE"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/cond/output/_18", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/cond/then/_11/sequential_2/sequential/random_crop/cond/Cast", "Func/StatefulPartitionedCall/sequential_2/sequential/random_crop/cond/else/_12/output/_37"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/cond_1/output/_27", "op": "Merge", "input": ["Func/StatefulPartitionedCall/sequential_2/sequential/random_crop/cond_1/then/_20/output/_42", "StatefulPartitionedCall/sequential_2/sequential/random_crop/cond_1/else/_21/sequential_2/sequential/random_crop/cond_1/Cast"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/sub", "op": "Sub", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/cond/output/_18", "StatefulPartitionedCall/sequential_2/sequential/random_crop/sub/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/stack", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/cond/output/_18", "StatefulPartitionedCall/sequential_2/sequential/random_crop/cond_1/output/_27"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/sub_1", "op": "Sub", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/cond_1/output/_27", "StatefulPartitionedCall/sequential_2/sequential/random_crop/sub_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/sub"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_INT32"}, "DstT": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/resize/ResizeBilinear", "op": "ResizeBilinear", "input": ["sequential_input", "StatefulPartitionedCall/sequential_2/sequential/random_crop/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}, "half_pixel_centers": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv_2/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/sub_1"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_DOUBLE"}, "SrcT": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv_1/Cast", "ConstantFolding/StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv_1_recip"], "attr": {"T": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv_2", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv_2/Cast", "ConstantFolding/StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv_2_recip"], "attr": {"T": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv_1"], "attr": {"SrcT": {"type": "DT_DOUBLE"}, "Truncate": {"b": false}, "DstT": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/Cast_1", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv_2"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_INT32"}, "SrcT": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/stack_1", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/stack_1/0", "StatefulPartitionedCall/sequential_2/sequential/random_crop/Cast", "StatefulPartitionedCall/sequential_2/sequential/random_crop/Cast_1", "StatefulPartitionedCall/sequential_2/sequential/random_crop/stack_1/3"], "attr": {"axis": {"i": "0"}, "N": {"i": "4"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/Slice", "op": "Slice", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/resize/ResizeBilinear", "StatefulPartitionedCall/sequential_2/sequential/random_crop/stack_1", "StatefulPartitionedCall/sequential_2/sequential/random_crop/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/flatten_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_2/sequential/random_crop/Slice", "StatefulPartitionedCall/sequential_2/flatten_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_3/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2/flatten_1/Reshape", "StatefulPartitionedCall/sequential_2/dense_3/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_2/dense_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_4/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2/dense_3/Relu", "StatefulPartitionedCall/sequential_2/dense_4/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_2/dense_4/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_5/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2/dense_4/Relu", "StatefulPartitionedCall/sequential_2/dense_5/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_2/dense_5/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_6/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2/dense_5/Relu", "StatefulPartitionedCall/sequential_2/dense_6/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_2/dense_6/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_2/dense_6/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 808}}, "weightsManifest": [{"paths": ["group1-shard1of6.bin", "group1-shard2of6.bin", "group1-shard3of6.bin", "group1-shard4of6.bin", "group1-shard5of6.bin", "group1-shard6of6.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/stack_1/0", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/sub/y", "shape": [], "dtype": "int32"}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv_1_recip", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice_1/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice_1/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/strided_slice_1/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/Greater/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/sub_1/y", "shape": [], "dtype": "int32"}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_2/sequential/random_crop/truediv_2_recip", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/stack_1/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/stack_2", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/flatten_1/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_3/MatMul/ReadVariableOp", "shape": [43200, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_3/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_4/MatMul/ReadVariableOp", "shape": [128, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_4/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_5/MatMul/ReadVariableOp", "shape": [256, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_5/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_6/MatMul/ReadVariableOp", "shape": [512, 4], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_6/BiasAdd/ReadVariableOp", "shape": [4], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/sequential_2/sequential/random_crop/cond/else/_12/output/_37", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/cond/then/_11/sequential_2/sequential/random_crop/cond/mul/x", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/sequential/random_crop/cond_1/else/_21/sequential_2/sequential/random_crop/cond_1/mul/x", "shape": [], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/sequential_2/sequential/random_crop/cond_1/then/_20/output/_42", "shape": [], "dtype": "int32"}]}]}